tutorials/19simpleTurbGeom/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];
oriented        oriented;


internalField   nonuniform List<scalar> 
17780
(
0.00250023
-2.29772e-07
0.00250046
-2.33463e-07
0.0025007
-2.40858e-07
0.00250096
-2.52069e-07
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
-0.0025
-0.0025
-0.0025
-0.0025
-0.0025
-0.0025
-0.0025
-0.0025
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
70
(
0.00133314
0.00133314
0.00133314
0.00133315
0.00133315
0.00133315
0.00133315
0.00133315
...
)
;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform 0();
    }
    frontAndBackLow
    {
        type            empty;
        value           nonuniform 0();
    }
    walls
    {
        type            calculated;
        value           uniform 0;
    }
    step
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
